1、There was once many sheiks (AABBA)
2、There was once an ant that was very thirst(BABAA)
3、In choosing a friend, one should be very careful. A good friend can help you study.(ABAAB)
4、No one is glad to hear that his body has to be cut open by a surgeon and par(ABBAA)
5、Mr. White lived in a small village. His parents hadn't enough mo(ABABA)
6、If you travel by air across the center of Africa or（AABBA）
7、Martin Luther King was a black minister,（ABAAB）
8、The French Revolution broke out in 1789. At the time Fran(ABBAB)
9、A foreigner’s first impression of the U.S. is lik （AABBA）
10、Sixteen-year-old Maria was waiting in line at the airport in （BAABA）
11、There was once a man in South America who had a parrot（AABBB）
12、Started in 1636, Harvard University is the oldest of all the many coll（AAABA）
13、The undersea world is very beautiful. Now more and more peop（AABBB）
14、Three man traveling on a train began a conversation abou（AAABB）
15、The United States covers a large part of the North American continent. Its neig（BCBDC）
16、What makes a person a scientist?    Does he have ways or tools of learning that（BCACD）
17、One day a bookseller (书商) let a big box of books fall on his f（BCDCA）
18、Today Newton is a very clean place. Many years ago, h（CCADC）
19、Mr. Froster lived by himself a long way form town. H（DCADC）
20、Once James Thornhill, a famous English painter, was asked to p（BBCCA）
21、Morgan Rees has always been a good businessman（ACBDB）
22、The residents of 24 Acacia Grove were dissatisfied（BBDAC）
23、When I was a little girl, my brothers and i collected stamps f（CBABD）
24、When John and Victoria Falls arrived in New York （DCBBD）
25、A characteristic of American culture that has become almost a tradition is to re（ABDAB）
26、How men first learnt to invent words is unknown; i（DCDBA）
27、Shyness is the cause of much unhappiness fo（BABCB）
28、In the United States, it is not customary to telephone so（BBBDB）
29、There are three kinds of goals: short-term, medium-range a（BDCCC）
30、Many people who work in London prefer to live outside i（BCBAC）
1.美国及美国人的由来 BCBDC 【掰扯不动产】
2.科学家 （BCACD）【不吃鹌鹑蛋】
3.书商（BCDCA）【不差点财啊】
4.牛顿市（CCADC）【出差爱打车】
5.汤姆 (DCADC )  【倒车啊倒车】
6.英国画家 （BBCCA）【保本财产啊】
7.好商人 （ACBDB）【啊！才八点半】
8.24号居民 （BBDAC）【爸爸打阿财】
9.集邮 （CBABD）【成本啊逼得】
10.约翰和维多利亚 （DCBBD）【大草包笨蛋】
11.美国文化特点 （ABDAB）【阿宝的阿爸】
12.如何发明单词(文字) (DCDBA)【单词得背啊】
13.羞怯不快乐原因 （BABCB）【悲哀悲催吧】
14.美国打电话 （BBBDB）【宝贝拨打吧】
15.目标有三种 （BDCCC）【北大冲冲冲】
16.在伦敦工作 （BCBAC） 【菠菜不爱吃】

