一类：我的某某人，如老师，妈妈，同学，朋友等。只想要记忆一篇并稍作改动，举例类似如下：
★My teacher of English（我的英语老师）/ My Teacher in High School（我的高中老师）My Teacher / A (good) teacher to remember（我的老师/难忘的老师）/ My Favorite Teacher (我最喜欢的老师)/
My English teacher is Miss Wang. 我的英语老师是王老师。She is a beautiful lady. 她很漂亮。She has a round face and bright eyes. 她长着一张圆脸和一对明亮的眼睛。She is always smiling. 她总是在微笑着。
Miss Wang is a good teacher. 王老师是一位好老师。She works very hard. 她工作非常努力。Every day she comes to the school early and is always the last one to leave. 每天她都很早到学校，总是最后一个离开。She speaks very good English and she teaches well. 她英语说得很棒，教得也很好。She also tells us what are the right things to do. 而且她还告诉我们如何明辨是非。She is a motherly teacher. 她是慈母般的老师。She treats us as her own children and takes good care of us. 她把我们当作自己孩子看待，细心照顾我们。She is so kind that everyone loves her.她人很好，大家都喜欢她。
This is Miss Wang, my favorite teacher. 这就是王老师，我最喜爱的老师。I feel so lucky to have her as my teacher. 我为有她这样的老师而感到幸运。I hope that someday I can be a teacher just like her.我希望有朝一日我也能成为像她这样的老师。
★My Best Friend（我最好的朋友）/ My Close Friend (我的好朋友)/ My best schoolmate（我的同学）/ My Classmates（我的同学）/ My best workmate（我最好的同事）
Li Xia is my best friend. 李霞是我最好的朋友。She is an English teacher. 她是位英语老师。She is a beautiful lady. 她很漂亮。She has a round face and bright eyes. 她长着一张圆脸和一对明亮的眼睛。She is always smiling. 她总是在微笑着。
Li Xia is a good teacher. 李霞是一位好老师。She works very hard. 她工作非常努力。Every day she comes to the school early and is always the last one to leave. 每天她都很早到学校，总是最后一个离开。She speaks very good English and she teaches well. 她英语说得很棒，教得也很好。She also tells her students what are the right things to do. 而且她还告诉她的学生们如何明辨是非。She is a motherly teacher. 她是慈母般的老师。She treats her students as her own children and takes good care of them. 她把学生当作自己孩子看待，细心照顾他们。She is so kind that everyone loves her. 她人很好，大家都喜欢她。
This is Li Xia, my best friend. 这就是李霞，我最好的朋友。I feel lucky to have her as my best friend. 我为有她这样的好朋友而感到幸运。I hope that we will be best friends forever. 我希望我们永远都是最好的朋友。
★My mother（我的母亲）/ The one I love most (我最爱的人)/ My Family(我的家庭)/ The man I love most in my life（最爱的人）/ My father（我的父亲）My beloved grandparents（我的祖父母）
My mother is an English teacher. 我的母亲是位英语老师。She is a beautiful lady. 她很漂亮。She has a round face and bright eyes. 她长着一张圆脸和一对明亮的眼睛。She is always smiling. 她总是在微笑着。
My mother is a good teacher. 我的母亲是一位好老师。She works very hard. 她工作非常努力。Every day she comes to the school early and is always the last one to leave. 每天她都很早到学校，总是最后一个离开。She speaks very good English and she teaches well. 她英语说得很棒，教得也很好。She also tells her students what are the right things to do. 而且她还告诉她的学生们如何明辨是非。She is a motherly teacher. 她是慈母般的老师。She treats her students as her own children and takes good care of them. 她把学生当作自己孩子看待，细心照顾他们。She is so kind that everyone loves her. 她人很好，大家都喜欢她。
This is my mother. 这就是我的母亲。I feel so lucky to have her as my mother and I love her. 我为有她这样的母亲而感到幸运，我也很爱她。I hope that someday I can be a teacher just like her. 我希望有朝一日我也能成为像她这样的老师。

二类：计划类，如国庆计划安排，新年安排，假期安排等。只想要记忆范文并稍作改动，范文如下：
★My Plan for the National Day Holiday（我的国庆假期计划）
The National Day Holiday is coming. 国庆假期要到了。It is a very important festival in China. 这是中国一个非常重要的节日。Everybody has his or her plan for the National Day Holiday. 每个人对于国庆节都有自己的计划。I have a plan, too. 我也有一个计划。My plan is as follows: 我的计划如下.
First, I’ll take a good rest, as I’m always busy with my work. 首先，我要好好休息一下，因为我平时工作很忙。Second, I want to stay with my parents. I’m not usually together with them. 第二，我想陪陪父母。我并不是经常与他们在一起。Third, I want to meet some of my friends and relatives, as these days we don’t see each other often. 第三，我想见见一些亲戚朋友，因为我们现在不怎么有机会见面。Fourth, I want to give my room a god cleaning. 第四，我想好好打扫下房间。Finally, I will study English for the coming examination. 最后，我想为即将到来的考试学习下英语。
This is my plan for the coming National Day Holiday. 这就是我对即将到来的国庆假期的计划。
可套用题目为：The Chinese New Year（中国新年），My Plan for the Spring Festival  (我的春节计划), My plan for summer vacation（我的暑假计划）/ My travel plan（我的旅行计划）

三类：英语学习类，此类要灵活运用范文，用在各类学习中
★Why I study English?（我为什么学习英语?）/ 或者:Why do students like learning English?  (为什么学生喜欢学习英语？) Why I Like Learning English (为什么我喜欢学英语)
English is an international language. 英语是一门国际性的语言。It is very useful. 它非常有用。I like English very much.我非常喜欢英语。 And this is how I study English.我就是这样学习英语的。
First, I remember 30 English words every day. 首先，我每天背30个英文单词。Second, I go over the grammar points regularly. 第二，我定期复习语法要点。Third, I read articles in English newspapers and I read simple novels in English. 第三，我阅读英文报纸的文章以及简单的英文小说。Fourth, I listen to English radio programs and watch English TV programs. 第四，我听英语的广播节目，看英语的电视节目。Finally, I listen to English music and watch English movies.最后，我听英文音乐，看英文电影。
This is how I study English. 我就是这样来学习英语的。As a result, I’m more and more interested in English and my English has improved greatly. 结果，我现在对英语更感兴趣了，英语也有了很大的进步。Practice makes perfect. 熟能生巧。If I keep practicing, I believe that my English will be better and better. 如果我继续不断练习的话，我的英语将会变得越来越棒。
可套用题目为：Self-study （自学）/How to achieve success of distance learning（如何在远程学习中获得成功，(My) School life（我的学校生活）(同my first year in college大学生活的第一年)/ My Study Plan(学习计划)，How to learn English well?（如何学好英语？）/My english study（我的英语学习），How to Overcome Difficulties in My English Studies（如何克服英语学习中的困难），Never Give Up（永远不要放弃），My Study Plan  我的学习计划，My Dream 我的理想，My Hobbies我的爱好，Why I Like Learning English 为何我喜欢英语

四类：优点和缺点，灵活运用到各类商品中
★Television/About Television（电视）
TV plays the vital role in ours life. 电视在我们生活中扮演重要角色。TV can be seen everywhere in our daily life. 电视在我们生活中随处可见。Almost each family has one TV set. 每个家庭都有电视。However, there is a good side and a bad side to everything, and TV is no exception.然而每件事都有他的两面性，电视也不例外。
TV has its advantages. 电视有它的优点。TV is very important to help me to get information and knowledge.电视能帮我获取信息 Various TV programs make me get to know the world and help me with my studies.丰富的电视节目让我不断的了解世界帮助我学习。
However, TV also has its disadvantages.然而电视也有缺点。 Watching too much TV program can waste a lot of time. 看太多电视浪费时间Some programs are boring and useless, and they can bring us bad information.有些节目无聊没用，并且会给我们带来坏的信息。
So, every coin has two sides, we should choose the right one.总之，一个硬币有它的两面，我们要选择好的那面。
可套用题目为：The Computer电脑/The Digital Products(数码产品），About Internet（论因特网），My Favorite TV program最爱的电视节目，On money（关于金钱）/ Money is not everything（金钱不是万能的）/Can Money Buy Happiness?（钱能带来快乐吗），Private Cars in China 中国私家车/ Buy a car or not?（买不买车？）/ On private cars（关于私家车），Advantages and Disadvantages of the Mobile Phone（手机的利与弊）/My Opinion on Cell Phones（我对于手机的想法），On TV Ads（论电视广告）/My view on the Negative Effects of Some Advertisements（广告的负面影响）

五类：运动类。使用范围较多，灵活运用。
★Do physical execise（锻炼身体）/About physical exercise(体育锻炼)/ The sports activities I like best(我最喜欢体育活动) / sports
Everyone hopes to live happily in the world. 每个人都想在这个世界上获得快乐。There is famous saying: ‘life lies on exercise’.俗话说生命在于运动 So exercise can help you live longer and more healthily.运动可以让你的生命延续活的更快乐。
First, exercise is good for us to build our bodies. 首先，运动能够迁建身体。It makes the heart beat faster and make us stronger. 让心脏跳动加快促使我们强壮。Sports can also make us eat more than usual which contributes to our bodies.运动能让我们比平时吃的更多让身体强壮。
Second, exercise can make us happy. 第二，运动能让我们快乐。Some sport like basketball is interesting.有些运动比如篮球很有意思 So playing basketball can bring us into happiness. 所以打篮球能带给我们快乐。
Third, exercise can help us get rid of our bad habits.第三，运动可以帮我们改掉坏习惯。 We will not be lazy after a period of exercise.一段时间的运动之后我们就不再懒惰。
In a word, exercise is important, helpful and absolutely necessary.总之，运动很重要，很有用也绝对必要。
可套用题目为：Health and Wealth健康与财富，My Favorite Sport（我最喜爱的运动）//My favorite form of entertainment（我最喜欢的娱乐形式）/ 或者：My Favorite Hobby（我喜欢的爱好），Ways to keep fit (保持健康的方法)/How to keep healthy（如何保持健康）/ Health and eating habits（健康及饮食习惯），My Hobbies（我的爱好）/ My Interests（我的兴趣爱好）/ How I spend my spare time（我如何度过闲暇时光）/My Favorite Hobby（我最喜欢的爱好/ My hobby（我的爱好）/ My activities in leisure time(我的休闲生活)/Sports（运动），My Favorite Food（我最喜欢的食物），My Favorite TV program最爱的电视节目，My Ideal Job（我理想的工作）/ The Job I Like（我喜欢的工作），My Favorite Book（我最喜爱的书）/ The Book I Like Best（我最爱的一本书），My favorite means of getting information（我最喜爱的获取信息的手段），The Sports Activities I Like Best（我最爱的体育运动）

六类：远程教育学习类。
★My expectation of the long-distance education（对远程教育的期望）
Now, I am a student in Shanghai TV university, in other words, I am a distance learner. 现在我在上海电大学英语。换言之，我是一名远程学习者。I have a lot of expectations on my distance education. 对远程教育，我有许多期待。Firstly, I hope to improve my spoken English. 第一，我希望可以提高我的英语口语。 I work in a foreign invested company, My boss is a foreigner, I need to talk with him in English every day, So I would like to improve my spoken English very much. 我在外企上班，老板是外国人，每天我都需要和他用英语交谈，所以我非常想要提高英语口语。 Secondly, I hope to improve my English writing ability. 第二，我希望提高英语写作能力。I need to receive and answer emails in English every day, but I don’t know many English words. 每天我都需要收发英语邮件，我词汇量不大。
These above are my expectations of the long-distance education. 以上这些是我对远程教育的期望。
可套用题目为：How to achieve success of distance learning（如何在远程学习中获得成功），The course I hate most of the long-distance education（我最讨厌的远程教育课程）/ Difficulty in Studying English英语学习的困难，My Favorite course（我最喜欢的课程）/ The course I like best of the long-distance education (我最喜欢的远程教育课程)

七类：书信类。此类套用一篇范文即可。范文如下：
                              ★  书信类范文 A letter to friend
May 1st, 2014
2014年5月1日
Dear Tom, 亲爱的汤姆.
Haven’t heard from you for some time! 很久没收到你的来信了。How are you doing? 你还好么？Everything is fine with me except that the final examination is getting nearer and nearer and I’m busy preparing for it. 我一切都挺好，只是期末考试越来越近了，我现在忙着准备复习迎考。
I’ve got some problems in my English study, especially in grammar. 我英语学习有些问题，尤其是语法方面。My teacher recommended me a grammar book. 我的老师向我推荐了一本语法书。The book is called Advanced English Grammar. 这本书叫做《高级英语语法》。But it is not sold here in my town. 但我这里没有卖的。Since you are in Beijing, could I you buy one for me? 既然你在北京，不知我能不能麻烦你帮我购买一本呢？I’d be very grateful if you could help me. 如果你能帮我这个忙的话，我将不胜感激。
We haven’t seen each other since last time we met. 自从上次相逢，我们再也未曾相见。I hope that you will visit my hometown again sometime if possible. 希望你如果有可能的话找个时间再来我家乡看看。So much has changed that you could barely recognize it! 它的变化很大，你几乎都认不出来了！And it would be great to be together with you once again. 而且，如果能与你再次相聚，真是太好了。
Looking forward to hearing from you soon. 盼复。
Best wishes! 祝好！
Yours此致
Alice爱丽丝
可套用题目有：
（1）.选择一个你想旅游的地点，并安排旅行计划。你应包括下列内容. 1.说明你想旅游的地点； 2.说明你为什么选择这个地点； 3.描述你的旅行计划。
（2）.假如你是李明，遗失了一本书。你应包括下列内容. 1.书在哪里遗失的； 2.这本书对你很重要； 3.拾到者应该如何和你联系。
（3）.你的一位外国朋友给你来信，打算到中国旅游。你给他回信，提出旅游建议。你的回信应包括下列内容. 1.接到朋友的来信； 2.你对旅游的安排计划及理由； 3.表达你希望见到朋友的心愿。
（4）.一封信  1.告诉对方你要从大学毕业。2.询问对方近况。3.问问能否在暑假聚会。
（5）. 了解对方毕业后的情况。 2.你的近况。 3.邀请对方方便时来访。
（6）. 了解对方近来的情况。 2.通知对方同学将在元旦举行聚会。3.请对方参加。
（7）. 了解对方最近的学习情况。2.你的学习情况。 3.请对方说说提高英语水平的经验。
（8）. 你的近况。2. 请对方帮你购买英语语法书。 3. 邀请对方方便时来访。

八类：最喜爱的某某。此类套用一篇范文。范文如下
★  范文My Favorite Book我最喜爱的一本书
My favorite book is My Childhood. 我最喜欢的书是《童年》。The reasons are as follows. 原因如下。
Firstly, it brings me happiness. 首先，它给我带来快乐。It always cheers me up when I am in a bad mood. 在我忧郁时，它总能让我舒展笑颜。
Secondly, I learn a lot from it. 第二，我从中学到了很多知识。It contains a lot of information about life and the world. 它包含很多人生和世事的哲理。It teaches me many new things. 教会了我很多新知识。
Thirdly, it makes me stronger. 第三，它让我更强大。It helps me find confidence in myself. 它让我找到了自信。With confidence I overcome all the difficulties I meet. 拥有了自信，我克服了种种艰难困阻。
Fourthly, it helps me realize my self worth. 第四，它让我实现自我价值。It enables be to find my place in life. 它帮我找到了人生的位置。I learn how to set a goal, work continuously towards the goal and embrace the future. 我学会了如何制定目标，不断努力，拥抱未来。
To sum up, I like My Childhood best. 总而言之，我最喜欢《童年》。
可套用题目有：My Favorite Food（我最喜欢的食物）/My Favorite Means of Transportation最喜爱的交通方式/My Favorite Season我最喜爱的季节/My Favorite TV Show最喜爱的电视节目/My Favorite Way to Get Information我最喜爱的获得信息的方式/My Favorite Job我最喜爱的工作 /My Favorite Long-distance Education Course我最喜爱的远程教育课程 /My Favorite Sport我最喜欢的体育运动

九类：议论文, 本部分分为2个题目, 可以直接背范文, 也可以套用万能模板表达 看法.
★  Honesty is the Best Policy （诚实乃上策）
There is an English proverb which says “honesty is the best policy.” It tells us the important of honesty. What’s the meaning of this saying? In my opinion, it means if you are honest to others, they will be honest to you. But if you lie to others, they will lie to you in return. For example, if you always lie to your friends, then you will have a habit of telling lies. When one day they know the truth, they will not trust you any longer. And you will lose all your friends in a near future.
★  Money is Not Everything （驳金钱万能论）
Nowadays, some people think that money is everything. They think money is the most important thing in the world. They believe that they can get anything with money. But I don’t think so. Although money can buy a lot of things we need, there are a lot of wonderful things in the world that can’t be bought with money. For example, knowledge can’t be bought with money. One can’t be rich in knowledge unless he/she studies hard. And as everybody knows, time can’t bought with money, either. No one can turn the wheel of time backwards. Once it goes by, it will never come back.

十类：感谢信，通知，请假条等， 可以直接背范文。
★  你应邀到一位好友家吃晚饭。 事后给朋友写信表示谢意。
Dear Amy,
Thank you for your invitation to your home last night. I enjoyed the food very much. I will hold a small party to celebrate my birthday on Nov 12th, and I will invite a lot of friends to have dinner at my home, would you like to join us? Oh, there will also be a band to perform live music. I think it will be an exciting dance. Please be sure to come. I am looking forward to your coming.
Yours,
Cynthia
★ 明天（星期五）全班同学将去参观科学博物馆 （the Science Museum）, 由你（班长）通知全体同学。
Fellow students,
Tomorrow we will visit the Science Museum on foot. Therefore we are going to gather at the school gate at 8 o’clock.
Please listen and watch carefully in the museum so as to write down something interesting. You are not allowed to shout loudly and take photos in the museum. Please take a pen and a notebook with you. On Monday of next week you are required to hand in a visiting report on the museum.
Thank you!
★ 假如你叫张琳，放学回家路上发生了交通事故， 你向班主任写一张请假条。
Dear Teacher,
Thanks for reading my asking for a sick leave. I went home by bike after school yesterday. Unfortunately, I fell from my bike and got injured badly. Then, I was sent to hospital by a kind-hearted citizen in time. And the doctor suggested I stay in bed for three days and have a good rest in order to make my injury recover quickly. Therefore, please allow me to be absent from class. And after three days, I would go to school.
Yours sincerely
Zhang Lin
★ 假如你叫李华， 你的同学正在开展一场讨论，主题是学生要不要参加体育锻炼。
Dear Editor,
I’m writing to tell you about a discussion we’ve had about whether the students should take physical exercise.
60% of the students think they should take all kinds of exercise every day, such as doing morning exercise, playing table tennis and playing basketball, but not spend too much time on them. Exercise builds their body and reduces lots of diseases.
On the other hand, 40% of the students believe taking exercise is a waste of time and it makes people feel tired. After having sports, they are too excited to study and it’s possible to be hurt in sports.
Yours sincerely
Li Hua




