1.—Why didn’t you come to my birthday party yesterday?（D）
2.—This box is too heavy for me to carry upstairs.（B）
3. -That’s a beautiful dress you have on!  (A)
4. -David injured his leg playing football yesterday. (C)
5. -Hi, is Mary there, please?-     (A)
6.    -It’s rather cold in here. Do you mind if I close the window?(B)
7. -Medam,do all the buses go downtown?(D)
8. -Could I speak to Don Watkins, please?(C)
9. -Thanks for your help.(A)
10.-Hello, I’m Harry Potter.(C)
11.-Excuse me, could you show me the way to the nearest post office? (D)
12.--Unbelievable! I have failed the driving test again! (B)
13.--Could you help me with my physics, please? (D)
14.—Haven’t seen you for ages! What are you busy doing now? (D)
15.—How do you do? Glad to meet you. (B)
16.—Who’s that speaking?/ Who’s speaking? (C)
17.—How are you, Bob?  (B)
18.-Paul,-Oh, that’s my father! And beside him, my mother. (B)
19.-How often do you go dancing? (C)
20.-Hello, may I talk to the director now? (A)
21.--I’m sorry. I lost the key. (A)
22.--     _?你爸爸是从事什么工作的？--He teaches physics in a school. (C)
23.-How was your trip to London,  (A)
24.-Thank you for inviting me. (C)
25.-May I see your tickets, please? (C)
26.--Please help yourself to the seafood.请 (D)
27.-Hey, Tom, what’s up? (B)
28.-Do you mind my smoking here? (B)
29.-I wonder if I could use your computer tonight? (A)
30.-We are going to have a singing party tonight. Would you like to join us? (A)
31.-How about going to dinner at the Mexican restaurant tonight? (C)
32.-Shall we sit up here on the grass or down there near the water?我 (A)
33.-Is it possible for you to work late tonight? (D)
34.-Must I take a taxi?   (D)
35.-Would you mind changing seats with me? (C)
36.-Wow!This is a marvelous room! I’ve never known you’re so artistic.    (C)
37.-    -Well, they got there last Wednesday. So about a week.  (B)
38.-Could I borrow your car for a few day? (C)
39.-Congratulations!You won the first prize in today’s speech contest. (C)
40.-Hi,Tom, how’s everything with you?   (B)
41.-Can you go to the concert with us this evening?     (B)
42.-Marilyn, I’m afraid I have to be leaving now. (B)
43 Hi, welcome back! Had a nice trip?。 (A)
44.  —Excuse me, how much is the jacket?     (D)
45. — May I use your bike for a moment?    (C)
1    - I’m sorry. I am late due to heavy traffic.  (A)
2. - Are you feeling better today, Jack.   (C)
3. Would you like something to drink? What about a cup of tea?   (A)
4. –Good morning, John. How are you doing?   (C)
5.- How do you do?        (B)
6. –Thank you for your invitation.       (B)
7. – Let me introduce myself. I’m Steward.       (B)
8. Let’s go to the library this afternoon.        (D)
9. –How tall is your sister?            (D)
10.- What  do you think of this novel？        (B)
11. –How much is this necklace?         (C)
12.- How can I get to the cinema?       (D)
13.- what’s the matter John?        (A)
14. – What are you majoring in?          (C)
15. – Is Mary there?           (A)
16.- What day is today?          (D)
17. – It’s that seat taken?      (B)
18.- Thank you for calling.            (C)t. Please forgive me.        (B)
27.- What a beautiful dress you have on today!   (D)
28.- I think he is a good lecturer. (B)
29.- What’s the matter, dear?
19.- How are you getting on today?   (A)
20.- How’s is your family?    (C)
21. –Would you like to go to the concert with us this evening?  (B)
22. – Thank you so much for the coat you bought me. (B)
23.-What’s the problem with your bike?  (C)
24. –Good-bye for now. (C)
25. – Hello, how are you?  (C)
26.- I  didn’t mean to do tha   (B)
30.-Good morning,  may I speak to Mark, please?     (D)
31.- Are you going on holiday for long time?     (C)
32.- What does Tom’s wife do for a living?   (A)
33.- I believe we’ve met somewhere before.   (C)
34.- Hello, could I speak to Mr. Smith, please?    (D)
35.-Let me introduce myself. I am Tom.    (D)
36. –I have passed the English exam.       (D)
37.-I am sorry. Bod is not in his office.    (A)
38. –Could you pass me the salt and pepper?   (B)
39.- I’d like to book a room, please.       (A)
40. – Thank you for your nice gift.           (A)
41.-Is it ok if I take this seat?       (C)
42.- I really don’t know how to thank you enough.  (B)
43.- Happy Teachers’ Day to you. Mr Wang!     (A)
44.- Can I help you?    (C)
45. May I use your dictionary?     (A)
