1. A lot of natural resources in the mountain area are to be exploited and used.那个山区有许多自然资源有待于开发利用。
2. All that glitters is not gold. 闪光的东西，未必都是金子。
3. Apples here like water and sunshine. 这里的苹果喜欢水和阳光。
4.As is known to all, China is a developing country. 众所周知，中国是一个发展中国家。
5.Bill hit his car into a wall last night. 昨晚比尔开车时车撞到了墙上。
6. Each time history repeats itself, the price goes up. 历史每重演一次，代价就增加（一分）。
7.He has taught English in this university ever since he moved to this city．自从移居到这座城市以来，他就一直在这所大学教英语。
8. I was having a nap when suddenly the telephone rang. 我在睡觉时，电话铃突然响了。
9. If you decided to learn a new language, you would have to dedicate yourself wholeheartedly to the cause.如果你决定学一门新的语言，你必须全身心地投入。
10. In an age of plenty, we feel spiritual hunger. 在这个物质财富充裕的时代，我们感到精神上的饥渴。
11. In no other country in the world can you find such plants as this one.像这种植物在世界上的其他任何一个国家中都找不到。
12. John and his brother differ in personality even if their differences in age are not significant.尽管约翰和他哥哥在年纪上相差不大，但他们的个性却不相同。
13.Please give this book to whoever comes first. 请把这本书给最先来的人。
14. Please move your chair to the window 请把你的椅子移动到窗口
15.Ted and William have lived under the same roof for five years.泰德和威廉已经在同一个屋檐下生活了五年了。
16. The more passions we have, the more happiness we are likely to experience.我们的激情越多，我们有可能体验到的快乐就越多。
17. The students are encouraged by their teacher to do more listening, reading and writing.老师鼓励学生多听，多读，多写。
18. There is a large amount of energy wasted due to friction. 由于摩擦而损耗了大量的能量。
19. This place has plentiful material resources. 这个地方有丰富的物质资源。
20.Though it was late, they kept on working. 尽管已经很晚了，他们还在继续工作。
21.Tom（人名有可能变化或Fred）was such a hardworking student that he soon came out first in the class.汤姆是一个学习十分用功的学生，以至于不久他就成了班里学习最好的学生。
22. Transistors are small in size and light in weight. 晶体管的体积小，重量轻。
23. Various substances differ widely in their magnetic characteristics. 各种材料的磁性有很大的不同。
24. Wang Li’s（人名有可能变化,4月为：Tom’s） father has taught English here since he graduated from Peking University.王丽的父亲从北京大学毕业后就一直在这里教英语。
25. would you please help me with this heavy box? 你能帮我搬一下这个很沉的箱子吗？
26. You needn’t go there anymore. He already knows about it. 你不必去了，他已经知道那件事
27. They thought that there must be something wrong with their TV set. 他们认为电视机一定出了毛病。
28. Life is meaningless without a purpose. 没有目标的生活是毫无意义的。
29. He didn't need to attend the meeting. 他没必要参加那个会议。
30. The friend say everything but did not say single word. 这位朋友看到了一切，却一言不发。
31. I will finish reading this book in a week. 我会在一周之内把这本书看完。
32. You should look around before you cross the street. 在过马路之前，你应该向四周看看。
33. I read the local newspapers with great interest every evening. 每晚我怀着极大的兴趣读当地的报纸。
34. He prefers coffee to tea.比起喝茶，他更喜欢喝咖啡。
35. Our textbooks are very different from theirs. 我们的教材与他们的教材很不一样
36. The doctor told me to have more water.        医生叫我多喝水
37. My classmate is more clever than me.  我的同学比我聪明。
38. The people’s Republic of China (PRC), founded on October 1,1949, covers an area of 9.6 million square kilometers. 中华人民共和国成立于1949年10月1日，国土面积约960万平方公里。
39. People all over the world are trying to help the people in Sichuan. 全世界人民都在尽力帮助四川人民。
40. We must take some measures to control the pollution. 我们必须采取措施来控制污染。
41. Trees need water to grow. 树木需要水才能生长。
42. A friend of mine from high school is working in England now. 我高中的一个朋友目前在英格兰工作。
43. I rang you house last night but your mother answered the phone. 我昨晚给你家打电话， 但接电话的是你母亲。
44. I knocked on the door but nobody came to answer it. 我敲了门，但是没有人来开门。
45. Would you mind closing the window for me? 你能帮我关一下窗户吗？
46. This new country hopes to establish friendly relations with all its neighbors. 这个新建立的国家希望和所有的邻国建立友好关系。
47. Most student feel satisfied with the progress they’ve made. 大多数学生对自己所取得的进步感到满意。
48. The doctor had no choice but reach out to their colleagues across the nation. 那个医生别无选择，只能向全国的同行求助。
49. Do you think you can do it by yourself? 你认为你自己可以单独完成这件事吗？
50. The Olympic Games is an international sports event that takes place every four years. 奥林匹克运动会是国际性的体育会，每四年举办一次。
51. She likes to help anyone who is in difficulty.  她乐意帮助任何一个有困难的人。
52. Who can help me clean the room? 谁能帮我打扫房间？
53. We should encourage him to have confidence in himself. 我们应当鼓励他对自己要有信心。
54. I slept soundly all night.  我整夜睡得很熟
55. Have you seen Tom recently? 你最近见到汤姆了吗？
56. I hope we can have some snow this winter. 我希望今年冬天会下雪
57. Are you fond of music?  你喜欢音乐吗？
58. You’d better do that again.  你最好再做一遍。
59. What kind of life do most people enjoy? 多数人喜欢什么样的生活？
60. How are you doing these days?  你最近怎么样？
61. This box can hold more books than that one.  这个箱子比那个箱子能装更多的书。
62. Both Ann and Mary are suitable for the job.  安妮和玛丽都适合干这个工作。
63. I hurried to my office.  我匆忙赶到了办公室。
64. The traffic jams during morning and afternoons rush hours are a headache in big cities now.上下班高峰期交通拥堵问题是大城市目前很棘手的问题。
65. Do you have access to the Internet?  你能上网吗？
Do you think students should do a part-time job? 你认为学生应该做兼职吗？
Give us a few more minutes to decide.  再给我们几分钟时间来做决定。
He has sympathy for all poor people.   他对所有的穷人都有一颗同情心。
I am wondering who broke the window 我想知道是谁打坏了窗户。
I think the picture shows us how fruits is necessary to life. 我想这幅图是告诉我们水果是生活中不可缺的。
In Foreign Languages Department, a checking machine is used to correct the students’ test papers.外语系用阅卷机给学生批卷。
The girls are busy making preparations for the weekend party 女孩们正忙于准备周末的聚会
The most common samples of inorganic materials are the gases of the atmosphere, water, rocks, ect.大气中的气体，水， 岩石等都是无机物中最普通的实例。
Who's going to answer the telephone?/Who's going to answer the door? 谁去接电话？/谁去开门？
Could you tell me where the post office is? 你能告诉我邮局在什么地方吗？
What time do you swimming every day?  你每天什么时候去游泳？
Look out the window it’s still raining today! 看窗外，今天还在下雨。
I’ve lost interest in my work.   我对这份工作已经失去了兴趣。
It’s very important to maintain your current weight though exercise and healthy eating. 通过锻炼和健康饮食来保持你目前的体重是非常重要的。
It normally takes a semester for a college freshman to adjust to this college life.  大学新生一般需要花一个学期的时间来适应大学生活。
I would appreciate it if you would just left me deal with this case. 如果你能让我独自处理这桩案件，我将不胜感激。
He has a foreign friend who lives in America.  他有一个住在美国的外国朋友。
He was very happy to hear from his old friend.  他很高兴收到老朋友的来信。
I’m thinking about a visit to Paris.   我在考虑去巴黎旅游。
A dog is always well-known as a clever and friendly animal. 在动物中， 狗素以其聪明与和善而著称。
A good memory is a great help in learning a language.  好的记忆力有助于语言的学习。
A teacher should have patience in his work.  当老师应当有耐心。
As long as there is water, plants won’t die quickly.  只要有水， 植物就不会很快死亡。
Can you express yourself clearly in English?  你能用英语清楚的表达自己的意思吗？
China will build up a space station in ten years.  中国将会在10年内建一个太空站。
Christmas is the most important festival in the west. 圣诞节是西方最重要的节日。
Do you often do washing in the evening? 你经常晚上洗衣服吗？
Don’t you mind me opening the window? 你不介意我打开窗户吧？
Don’t you think smoking is harmful to your health?  你不认为吸烟有害健康吗?
Everyone was in bed except me.   除了我， 所有的人都在床上睡觉了。
Excuse me, where’s the nearest police station? 劳驾，离这儿最近的派出所在哪里？
Fires may do more damage than the earthquakes. 火灾造成的损失可能比地震还严重。
Go down this street until you reach the second traffic lights. 顺着这条路走，一直走到第二个交通灯处。
He doesn’t know what life means to him.  他不知道人生的意义。
He had a traffic accident last week.  他上星期出了一起交通事故。
He has been learning English for years.  多年来，他一直在学习英语
He has taught in this university since he moved to this city. 他从他搬迁到这座城市之后就一直在这所大学里教英语。
He is always making excuses for being late.  他总是为他的吃到找借口。
He is always very active in student activities. 他总是积极参与学生活动。
He is sweating all over.他出了一身汗。
He is thinking about moving to a new place.他正在考虑搬到一个新的的地方
He keeps looking at himself in the mirror.他老是照镜子。
He stopped smoking.他戒烟了。
He was too tired to go on reading.他太困了，无法再阅读了。
How do you spell your last name?你的姓是如何拼写的？
How long have you collected your stamps?你集邮有多久了？
How long will it take us to get there?我们到那儿要用多长时间？
I am very familiar with his name.我很熟悉他的名字。
I came back because of the rain.因为下雨我就回来了。
I can't go with you today because I'm too busy. 我今天不能和你一块儿去，因为我太忙了。
I do want to know what really happened.我确实想知道到底发生了什么事。
I don't think he can operate the new type of computer. 我认为他不会操作这种计算机。
I don't want to spend five dollars on a cup of water.我不想花五美元买一瓶水。
I expect she will have changed her mind by tomorrow.我预料到明天为止她会改变观点。
I feel lonely without you.没有你我感到孤独
I feel satisfied with my life.我对我的生活感到满意。
I have a pain in my back.我的背疼。
I look forward to hearing from you.我期待着收到您的回信。
I need to buy some 50-cent stamps. 我需要买一些50美分的邮票
I prefer tea to coffee.我宁可要茶，不要咖啡。
I think our dream will become ture. 我想我们的梦想将实现。
I'll call you as soon as I arrive.我一到就给你打电话。/ I'll write to you as soon as I get there. 我一到那儿就给你写信
I'm certain he'll go to see the film, because he's bought a ticket. 我肯定他会去看电影，因为他已经买了票
I'm going to buy a monthly ticket tomorrow.我想明天买张月票。
I'm not an English major student.我不是英语专业的学生。
I’m now a distance education student. 我现在是远程教育的学生。
I'm very much eager to improve my oral English.我非常渴望改进我的英语口语。
